#include "Atom.h"

// const std::unordered_map<int, AtomTypeData> Atom::typeData = {
//     {1,  {1.0080, 0.53, 0.0, sf::Color(255, 255, 255, 255)}},  // Водород
//     {6,  {12.011, 0.67, 0.0, sf::Color(0,   0,   0,   255)}},  // Углерод
//     {7,  {14.007, 0.56, 0.0, sf::Color(80,  70,  230, 255)}},  // Азот
//     {8,  {15.999, 0.48, 0.0, sf::Color(255, 50,  50,  255)}}   // Кислород
// };

const std::array<StaticAtomicData, 118> Atom::properties = {{
        {0.0000,  0.0, 0.0, sf::Color::Transparent       },
        {1.0080, 0.53, 0.0, sf::Color(255, 255, 255, 255)},  // Водород
        {4.0026, 0.31, 0.0, sf::Color(0,   0,   0,   255)},  // Гелий
        {6.9390, 1.67, 0.0, sf::Color(0,   0,   0,   255)},  // Литий
        {9.0122, 1.12, 0.0, sf::Color(0,   0,   0,   255)},  // Бериллий
        {10.811, 0.87, 0.0, sf::Color(0,   0,   0,   255)},  // Бор
        {12.011, 0.67, 0.0, sf::Color(0,   0,   0,   255)},  // Углерод
        {14.007, 0.56, 0.0, sf::Color(80,  70,  230, 255)},  // Азот
        {15.999, 0.48, 0.0, sf::Color(255, 50,  50,  255)},  // Кислород
        {18.998, 0.42, 0.0, sf::Color(0,   0,   0,   255)},  // Фтор
        {20.179, 0.38, 0.0, sf::Color(0,   0,   0,   255)},  // Неон
        {22.990, 1.90, 0.0, sf::Color(0,   0,   0,   255)},  // Натрий
        {24.305, 1.45, 0.0, sf::Color(0,   0,   0,   255)},  // Марганец
        {26.981, 1.18, 0.0, sf::Color(0,   0,   0,   255)},  // Алюминий
        {28.086, 1.11, 0.0, sf::Color(0,   0,   0,   255)},  // Кремний
        {30.974, 0.98, 0.0, sf::Color(0,   0,   0,   255)},  // Фосфор
        {32.064, 0.88, 0.0, sf::Color(0,   0,   0,   255)},  // Сера
        {35.453, 0.79, 0.0, sf::Color(0,   0,   0,   255)},  // Хлор
        {39.948, 0.71, 0.0, sf::Color(0,   0,   0,   255)},  // Аргон
    }};

Atom::Atom(float x, float y, int type) : coords(x, y), type(type) {}